[
    {
      "bookId": 1,
      "bookName": "To Kill a Mockingbird",
      "author": "Harper Lee",
      "image": "https://i.postimg.cc/1tFqwmmz/to-Kill-AMockingbird.jpg",
      "review": "To Kill a Mockingbird by Harper Lee is a poignant exploration of racial injustice and moral growth set in the backdrop of the American South during the 1930s. Through the eyes of Scout Finch, the novel delves into the complexities of race relations, prejudice, and compassion. Harper Lee's prose is masterful, capturing the innocence of childhood while addressing weighty themes with sensitivity and depth. The character of Atticus Finch serves as a beacon of integrity and righteousness, embodying the moral compass that guides the narrative.Lee's portrayal of small-town life and the trial of Tom Robinson provides a compelling commentary on societal norms and the struggle for justice. The book's enduring relevance lies in its ability to provoke introspection and empathy, challenging readers to confront their own biases and stand up against injustice. To Kill a Mockingbird remains a timeless classic that continues to resonate with readers, reminding us of the importance of empathy, courage, and the pursuit of truth in the face of adversity.",
      "totalPages": 281,
      "rating": 4.5,
      "category": "Fiction",
      "tags": ["classic", "social justice", "American literature"],
      "publisher": "J.B. Lippincott & Co.",
      "yearOfPublishing": 1960
    },
    {
      "bookId": 2,
      "bookName": "The Great Gatsby",
      "author": "F. Scott Fitzgerald",
      "image": "https://i.postimg.cc/xdvQzBr2/the-Great-Gatsby.jpg",
      "review": "The Great Gatsby by F. Scott Fitzgerald is a captivating portrayal of the roaring twenties, infused with themes of love, wealth, and disillusionment. Set amidst the opulence of Long Island, the novel follows the enigmatic Jay Gatsby and his relentless pursuit of the elusive Daisy Buchanan. Fitzgerald's prose is mesmerizing, drawing readers into a world of extravagant parties and hidden desires. Through vivid characterization and intricate plot twists, the novel explores the emptiness lurking beneath the glittering facade of the Jazz Age. With its timeless commentary on the American Dream and the complexities of human ambition, The Great Gatsby remains a poignant and thought-provoking masterpiece that continues to resonate with readers today.",
      "totalPages": 180,
      "rating": 4.7,
      "category": "Fiction",
      "tags": ["classic", "American literature", "romance"],
      "publisher": "Charles Scribner's Sons",
      "yearOfPublishing": 1925
    },
    {
      "bookId": 3,
      "bookName": "1984",
      "author": "George Orwell",
      "image": "https://i.postimg.cc/26JfRYhn/1984.jpg",
      "review": "1984 by George Orwell is a thought-provoking masterpiece that plunges readers into a dystopian world where totalitarianism reigns supreme. Orwell's vivid prose paints a bleak picture of a society under constant surveillance, where individuality is suppressed and truth is manipulated to serve the ruling party's agenda. Through the eyes of protagonist Winston Smith, Orwell explores themes of government oppression, psychological manipulation, and the erosion of personal freedoms. The novel's chilling portrayal of a surveillance state remains alarmingly relevant in today's world, serving as a cautionary tale against the dangers of unchecked authority and the importance of preserving civil liberties. With its haunting imagery and profound insights, 1984 continues to captivate and disturb readers, reminding us of the enduring power of Orwell's prophetic vision.",
      "totalPages": 328,
      "rating": 4.6,
      "category": "Fiction",
      "tags": ["dystopian", "political fiction", "surveillance"],
      "publisher": "Secker & Warburg",
      "yearOfPublishing": 1949
    },
    {
      "bookId": 4,
      "bookName": "The Catcher in the Rye",
      "author": "J.D. Salinger",
      "image": "https://i.postimg.cc/J4Jvzg9c/The-Catcher-in-the-Rye.jpg",
      "review": "The Catcher in the Rye by J.D. Salinger is a poignant portrayal of adolescent rebellion and existential angst. Through the cynical and introspective voice of Holden Caulfield, Salinger navigates the complexities of growing up, grappling with themes of alienation, identity, and the loss of innocence. Holden's journey through the streets of New York City provides a raw and authentic exploration of teenage disillusionment, capturing the reader's empathy with his candid observations and unfiltered emotions. Salinger's masterful prose delves into the turmoil of adolescence with a blend of wit and vulnerability, offering a timeless narrative that resonates with readers across generations. The Catcher in the Rye remains a seminal work of literature, challenging societal norms and inviting readers to confront the universal struggle of finding one's place in the world.",
      "totalPages": 224,
      "rating": 4.4,
      "category": "Fiction",
      "tags": ["coming-of-age", "culture","American literature" ],
      "publisher": "Little, Brown and Company",
      "yearOfPublishing": 1951
    },
    {
      "bookId": 5,
      "bookName": "The Hobbit",
      "author": "J.R.R. Tolkien",
      "image": "https://i.postimg.cc/6q08wzLr/the-Hobbit.jpg",
      "review": "The Hobbit by J.R.R. Tolkien is a timeless adventure that enchants readers with its captivating storytelling and richly imagined world. Set in the enchanting realm of Middle-earth, this tale follows the journey of Bilbo Baggins, a humble hobbit, who embarks on an epic quest alongside dwarves and the wizard Gandalf to reclaim a treasure guarded by the fearsome dragon Smaug. Tolkien's masterful prose brings to life a world filled with mythical creatures, ancient landscapes, and thrilling encounters. The story's charm lies not only in its epic battles and quests but also in its themes of courage, friendship, and self-discovery. With its enchanting narrative and memorable characters, The Hobbit remains a beloved classic that continues to inspire readers of all ages to embark on their own adventures.",
      "totalPages": 310,
      "rating": 4.8,
      "category": "Fantasy",
      "tags": ["fantasy", "adventure", "epic"],
      "publisher": "Allen & Unwin",
      "yearOfPublishing": 1937
    },
    {
      "bookId": 6,
      "bookName": "Pride and Prejudice",
      "author": "Jane Austen",
      "image": "https://i.postimg.cc/D0tMvdvz/pride-prejudice.jpg",
      "review": "Pride and Prejudice by Jane Austen is a masterpiece of romantic fiction that intricately weaves together societal commentary and love. Set in Regency-era England, Austen's sharp wit and keen observation illuminate the intricacies of class, manners, and marriage. At its heart lies the spirited Elizabeth Bennet and the enigmatic Mr. Darcy, whose tumultuous relationship unfolds amidst societal expectations and personal biases. Austen's prose is elegant yet accessible, drawing readers into a world of ballrooms, country estates, and familial drama. Through Elizabeth's journey of self-discovery and overcoming prejudice, Austen delivers a timeless message of the importance of understanding, forgiveness, and the transformative power of love. Pride and Prejudice remains an enduring classic, captivating generations with its vibrant characters, sparkling dialogue, and timeless themes.",
      "totalPages": 279,
      "rating": 4.6,
      "category": "Fiction",
      "tags": ["romance", "classic", "social satire"],
      "publisher": "T. Egerton, Whitehall",
      "yearOfPublishing": 1813
    },
    {
      "bookId": 7,
      "bookName": "Moby-Dick; Moby-Dick",
      "author": "Herman Melville",
      "image": "https://i.postimg.cc/8zwxWvwZ/mobyDick.jpg",
      "review": "Moby-Dick; or, The Whale by Herman Melville is a literary voyage into the depths of obsession and vengeance on the vast expanse of the sea. Melville's magnum opus explores the complexities of human nature through the enigmatic Captain Ahab's relentless pursuit of the eponymous white whale. The narrative unfolds with rich prose, delving into themes of ambition, isolation, and the inexorable struggle against forces beyond human control. Through vivid descriptions of whaling life and the perilous journey aboard the Pequod, Melville creates an immersive experience that captivates readers from the opening lines to the climactic confrontation with Moby Dick. This timeless classic stands as a testament to the power of storytelling and continues to resonate with its profound exploration of the human condition.",
      "totalPages": 635,
      "rating": 4.3,
      "category": "Fiction",
      "tags": ["adventure", "classic", "seafaring"],
      "publisher": "Richard Bentley (UK), Harper & Brothers (US)",
      "yearOfPublishing": 1851
    },
    {
      "bookId": 8,
      "bookName": "The Lord of the Rings",
      "author": "J.R.R. Tolkien",
      "image": "https://i.postimg.cc/MZN6MCXn/the-Lord-Of-The-Rings.jpg",
      "review": "The Lord of the Rings is a monumental epic that transports readers to a world of unparalleled imagination and adventure. J.R.R. Tolkien's masterpiece weaves a mesmerizing tapestry of heroism, friendship, and the eternal struggle between good and evil. From the pastoral idylls of the Shire to the fiery depths of Mount Doom, the journey of Frodo Baggins and his companions captivates with its depth and breadth. Tolkien's richly detailed world-building and lyrical prose draw readers into a realm where every blade of grass holds significance and every character, whether humble hobbit or majestic elf, resonates with authenticity. With its intricate plot, unforgettable characters, and profound themes of sacrifice and redemption, The Lord of the Rings stands as a timeless classic of fantasy literature, enchanting generations of readers with its enduring magic.",
      "totalPages": 1178,
      "rating": 4.9,
      "category": "Fantasy",
      "tags": ["epic", "fantasy", "adventure"],
      "publisher": "Allen & Unwin",
      "yearOfPublishing": 1954
    }
  ]
  